1C_for_GitHub_by_Frolov/src/ExternalDataProcessors/ПроверкаДоступностиРесурса/ПроверкаДоступностиРесурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ПроверкаДоступностиРесурса</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверЛогин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеМетодаПост</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

1C_for_GitHub_by_Frolov/src/ExternalDataProcessors/ПроверкаДоступностиРесурса/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРесурс(Команда)
	
	Защита = Неопределено;
	Если Объект.SSL Тогда
		Защита = Новый ЗащищенноеСоединениеOpenSSL;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Объект.Сервер, , СокрЛП(Объект.СерверЛогин), СокрЛП(Объект.СерверПароль), , Объект.Таймаут,Защита);
	
	httpЗапрос = Новый HTTPЗапрос(Объект.Адрес);
	Если Объект.Метод = "POST" Тогда
		httpзапрос.УстановитьТелоИзСтроки(Объект.СодержимоеМетодаПост);
		Для Каждого СтрокаЗаголовка ИЗ ЗаголовкиМетодаПост Цикл
			 httpзапрос.Заголовки.Вставить(СтрокаЗаголовка.Имя, СтрокаЗаголовка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		Результат =  Соединение.ВызватьHTTPМетод(Объект.Метод, httpЗапрос);
		
		РезультатКлиент = "Код состояния: " + Результат.КодСостояния + Символы.ПС + Результат.ПолучитьТелоКакСтроку();
	Исключение
		РезультатКлиент = "Ошибка открытия сайта, " + ОписаниеОшибки();
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ПримерКурсВалют(Команда)
		
	Объект.SSL = Истина;
	Объект.СерверЛогин = "frolov_a";
	Объект.СерверПароль = "1";
	Объект.Сервер = "currencyrates.1c.ru";
	Объект.Адрес  = "/exchangerate/v1/840.tsv";
	
	ОткрытьРесурс (Неопределено);
	//2
КонецПроцедуры
#КонецОбласти
